# RevitLinkUIUtils Class

---
A class containing functions for displaying user interface related to Revit links.
SystemObject Autodesk.Revit.UIRevitLinkUIUtils
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class RevitLinkUIUtils

    Public NotInheritable Class RevitLinkUIUtils

    public ref class RevitLinkUIUtils abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type RevitLinkUIUtils = class end
The RevitLinkUIUtils type exposes the following members.
| Name| Description
---|---|---
| ReportLinkLoadResults|
Top
#### Reference
Autodesk.Revit.UI Namespace